import { Container, IconButton, Typography } from '@mui/material';
import React from 'react';

import ArrowBackIosIcon from '@mui/icons-material/ArrowBackIos';
import Link from 'next/link';
const ourHistory = ({showFull}) => {

    

    return (
        <>
            <Link  href='/'>
            <IconButton
                size="large"
                edge="start"
                color="secondary"
                aria-label="menu"
                sx={{ m: 3 }}
                
            >
                <ArrowBackIosIcon></ArrowBackIosIcon>
            </IconButton>
            </Link>
            <Container sx={{ mt: 5 }}>
                <Typography variant='h2' style={{ color: '#02a650', textAlign: 'center' }}>

                    বিদ্যালয় পরিচিতি ও ইতিহাস
        </Typography>
                <Typography variant='p' style={{ color: 'black', textAlign: 'center' }}>
                    চট্টগ্রামেরঐতিহ্যবাহী প্রাচীনতম শিক্ষা প্রতিষ্ঠান গভ মুসলিম হাই স্কুল, কোতোয়ালি থানাধিনআব্দুর রহমান সড়কে, আদালত ভবন (কোর্ট বিল্ডিং) এর সামনে রাস্তার পূ্ব পাশেঅবস্থিত।

                    বিংশশতাব্দীর প্রথম দশকে গভ মুসলিম হাই স্কুল, চট্টগ্রাম প্রতিষ্ঠিত হয়েছিল মুহসিনফান্ডপুষ্ট হয়েই। মুসলিম সমাজের উন্নতি, ঐতিহ্য, কৃষ্টি কালচার সমুন্নতকরন এবংমুসলিম ছাত্র সমাজকে আধুনিক শিক্ষার প্রতি আকৃষ্ট করার তাগিদে স্থানীয় মুহসিনিয়াসরকারি মাদ্রাসার অধ্যক্ষের তত্ত্বাবধানে ‘এ্যাংলো-পার্সিয়ান ডিপার্টমেন্ট’ হিসেবে মুসলিম হাই স্কুলের গোড়াপত্তন হয়। এতে আধুনিক শিক্ষা লাভের প্রতিআকৃষ্ট হয়ে পড়েন সচেতন অভিভাবক ও ছাত্ররা। খুব কম সময়ের ব্যাবধানে এডিপার্টমেন্টের ছাত্র সংখ্যা বাড়তে থাকলে প্রয়োজনের তাগিদে এ ডিপার্টমেন্টটিরেজিস্ট্রেশান ভবনে অর্থাৎ বিদ্যালয়ের বর্তমান অবস্থানে স্থানান্তরিত হয় ১৯০৯খ্রিস্টাব্দে। স্থানীয় শিক্ষানুরাগীদের দাবি ও চেষ্টার ফলে উক্ত ডিপার্টমেন্টটি ১৯১০খ্রিস্টাব্দে গভ মুসলিম হাই স্কুল নামে বর্তমান জায়গায় পর্তুগিজ আমলে নির্মিতপুরাতন দ্বিতল ভবনে স্থানান্তরিত হয় পুর্নাঙ্গ স্কুলের স্বাধীন সত্তা নিয়ে। অবশ্যএ বিদ্যালয়ের স্বাধীন গভর্নিং বডি গঠিত হয় ১৯১৬ সালে। উল্লেখ থাকে যে, বাংলাদেশেরদক্ষিণ পুর্বাঞ্চলে এটাই একমাত্র স্কুল যা স্থাপিত হয়েছিল কেবল মুসলিম ছাত্রদেরশিক্ষালাভের জন্য।

                    পর্তুগিজআমলে নির্মিত মৌচাক সদৃশ এ ভবনটি অনেক কক্ষের সমষ্টি হলেও গঠন ও আকৃতিগতভাবে এটিএকটি মডেল বিদ্যাপীঠের উপযোগী ছিল না। অবকাঠামোগত দিক দিয়ে স্কুলটি আকর্ষণীয় নাহলেও গুণগত, আদর্শ ও কৃষ্টিগতভাবে এটি ছিল তৎকালীন মুসলিম পরিবারের মেধাবী ওপ্রতিভাবান ছাত্রদের আকর্ষণীয় শিক্ষালয়। সেই সময়ে এই স্কুলকে মনে করা হতো মুসলিমঐতিহ্য ও তমদ্দুনের প্রতীক হিসেবে। ছাত্রদের একাগ্রতা, অভিজ্ঞ শিক্ষকবৃন্দের নিরলসসেবা এবং সুদক্ষ প্রধান শিক্ষকবৃন্দের সুষ্ঠু পরিচালনায় স্বল্পকালের মধ্যে অবিভক্তবাংলার শ্রেষ্ঠ ও খ্যাতনামা স্কুলে পরিগনিত হয় এটি। সুখ্যাতি অর্জনের মাধ্যমেকর্তৃপক্ষের দৃষ্টি আকর্ষণ করতে সক্ষম হলে তৎকালীন বঙ্গদেশের বড়লাট লর্ডকারমাইকেল, বঙ্গীয় শিক্ষা নির্বাহি পরিষদের সদস্য বর্ধমানের রাজা, লর্ড মিন্টনপ্রমুখ সম্মানিত ব্যক্তি বর্গের পরিদর্শন লাভেও বিদ্যালয়টি গৌরবান্বিত হয়।বিভিন্নক্ষেত্রে স্কুলের অগ্রগতি ও প্রশংসনীয় কর্মকাণ্ডে তারা বিমুগ্ধ হন। স্কুলটিতাঁদের নিকত থেকে যুগোপযুগী এবং শিক্ষা পরিবেশের সাথে সামঞ্জস্যপূর্ণ একটি আধুনিকভবনের প্রয়োজনীয়তার স্বীকৃতি অরজন করলেও নানা কারন ও অজুহাতে সে স্বীকৃতিরবাস্তবায়ন প্রতিষ্ঠানটির ভাগ্যে তখনও জোটে নি। দেশ বিভাগের পর ভারত হতে আগতউর্দুভাষী মুসলিম বিশেষ করে প্রতিরক্ষা বাহিনীর পোষ্যদের প্রয়োজনে এই স্কুলে ১৯৫১খ্রিস্টাব্দে উর্দু সেকশন খোলা হয়। ছাত্র ভরতি-চাপ নিরসনকল্পে ১৯৬৪ খ্রিস্টাব্দেপ্রভাতী শাখা ও চালু করা হয়। একনিষ্ঠ নিবেদিতপ্রাণ মনীষীদের নিরলস সেবা এবং সুদক্ষপরিচালনার বদৌলতে এই শিক্ষাপ্রতিষ্ঠান ধাপে ধাপে উন্নতির উচ্চশিখরে আরোহণ করে। পূবপাকিস্তানের শিক্ষা সপ্তাহ উদযাপন উপলক্ষে ঢাকায় অনুষ্ঠিত স্ব স্ব বিদ্যালয়েপ্রকাশিত ম্যাগাজিন প্রদর্শনীতে ১৯৬১ ও ১৯৬২ খ্রিস্টাব্দে পর পর দুবার এইপ্রতিষ্ঠান প্রথম স্থান দখলের গৌরব অর্জন করে।

                    প্রতিষ্ঠানটিরমোট  ভুমির পরিমান ৩.৭২ একর। বিল্ডিংসংখ্যা ১০। প্রশাসনিক ভবন ০১ টি, একাডেমিক ভবন ০৩ টি, বিজ্ঞান ভবন ০১ টি,ছাত্রমিলনায়তন ০১ টি, প্রধান শিক্ষকের বাসভবন ০১ টি, জিমনেশিয়াম ০১ টি, মসজিদ ০১টি ও খেলার মাঠ ০২ টি (ঐতিহাসিক লালদীঘির মাঠসহ)।

                    ১৯০৯ থেকে২০১৫ এই দীর্ঘ পথ পরিক্রমায় কত ত্যাগ, কত শ্রম, কত বিঘ্ন বাধার দেয়াল ডিঙিয়ে পাওয়ানা পাওয়ার ভেতর দিয়ে চট্টগ্রাম গভ মুসলিম হাই স্কুল আজ অবুঝ মনের সবুজ প্রানেরচটুল ছন্দে ছুটে ছলা শিক্ষার্থীদের প্রাণপ্রিয় পরিপূর্ণ শিক্ষালয়।

                    মানবসভ্যতার ঊষালগ্ন থেকেই এ পৃথিবী গড়ে উঠেছে এক বিশাল কর্মশালা হিসেবে। কর্মেরঅস্তিত্বের উপর ভর করেই দাঁড়িয়ে আছে বিশ্বপরিমণ্ডল। গগনচুম্বী সুরম্য অট্টালিকা,আলোকোজ্জ্বল রাজপথ, ফোয়ারার কারুকার্যময় জলোৎক্ষেপণ নয় কোন দৈব শক্তির অবদান।রুপকথার আলাদিনের আশ্চরজ প্রদীপের কাহিনী আমাদের জানা থাকলেও সভ্যতার এ চরমবিকাশের মূলে রয়েছে মানব জাতির বৈচিত্র্যময় অফুরন্ত কর্মপ্রবাহ। আমরা চাই প্রগতি,চাই শিক্ষা, সাহিত্য, সংস্কৃতি, ক্রীড়া ও শিল্পসমৃদ্ধ একটি ভারসাম্যময় সমাজ। সেইসমাজ বিনির্মাণে গভ হাই স্কুল, চট্টগ্রাম এর রয়েছে বিচিত্র কর্মপ্রবাহ।
        </Typography>


            </Container>
        </>
    );
};

export default ourHistory;